# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [17]:
import pandas as pd
users = pd.read_csv(r"https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user",sep = "|")
users1 = users.set_index(["user_id"])

### Step 4. See the first 25 entries

In [1]:
users1.tail(25)

NameError: name 'users1' is not defined

### Step 5. See the last 10 entries

In [19]:
users1.tail(25)

         age gender     occupation zip_code
user_id
919       25      M          other    14216
920       30      F         artist    90008
921       20      F        student    98801
922       29      F  administrator    21114
923       21      M        student    E2E3R
924       29      M          other    11753
925       18      F       salesman    49036
926       49      M  entertainment    01701
927       23      M     programmer    55428
928       21      M        student    55408
929       44      M      scientist    53711
930       28      F      scientist    07310
931       60      M       educator    33556
932       58      M       educator    06437
933       28      M        student    48105
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [20]:
len(users1)

943

### Step 7. What is the number of columns in the dataset?

In [21]:
len(users1.columns)

4

### Step 8. Print the name of all the columns.

In [22]:
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [23]:
users.index

RangeIndex(start=0, stop=943, step=1)

### Step 10. What is the data type of each column?

In [24]:
col = list(users.columns)
for k in col:
    print(k,"is",users[k].dtype)

user_id is int64
age is int64
gender is object
occupation is object
zip_code is object

### Step 11. Print only the occupation column

In [25]:
users[["occupation"]].head()

   occupation
0  technician
1       other
2      writer
3  technician
4       other

### Step 12. How many different occupations there are in this dataset?

In [26]:
users1["occupation"].nunique()

21

### Step 13. What is the most frequent occupation?

In [32]:
users[["occupation"]].mode()

  occupation
0    student

### Step 14. Summarize the DataFrame.

In [33]:
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

### Step 15. Summarize all the columns

In [35]:
cols = list(users.columns)
for i in cols:
    print(i,"is described as",users[i].describe())
    print()
    print()

user_id is described as count    943.000000
mean     472.000000
std      272.364951
min        1.000000
25%      236.500000
50%      472.000000
75%      707.500000
max      943.000000
Name: user_id, dtype: float64


age is described as count    943.000000
mean      34.051962
std       12.192740
min        7.000000
25%       25.000000
50%       31.000000
75%       43.000000
max       73.000000
Name: age, dtype: float64


gender is described as count     943
unique      2
top         M
freq      670
Name: gender, dtype: object


occupation is described as count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object


zip_code is described as count       943
unique      795
top       55414
freq          9
Name: zip_code, dtype: object

### Step 16. Summarize only the occupation column

In [36]:
users[["occupation"]].describe()

       occupation
count         943
unique         21
top       student
freq          196

### Step 17. What is the mean age of users?

In [37]:
users.age.mean()

34.05196182396607

### Step 18. What is the age with least occurrence?

In [47]:
df = pd.DataFrame(users["age"].value_counts(ascending = True,dropna = True))
df.head(1)

   age
7    1